[
  {
    "id": 1,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-2.png",
    "uploadedDate": "1/9/2024",
    "title": "Champions Again: India's Glorious World Cup Victory!",
    "description": "India celebrated a historic victory in the 2024 World Cup, triumphing with exceptional skill and resilience. Led by their captain's inspiring leadership, the team showcased dominance throughout the tournament, captivating fans worldwide.",
    "media": "image",
    "mediaPath": "/assets/images/image-1.png",
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["forYou"]
  },
  {
    "id": 2,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-2.png",
    "uploadedDate": "25/8/2024",
    "title": "AI Technology Effect on Human Life",
    "description": "AI is driving innovation across multiple industries. In healthcare, AI-powered diagnostic tools enable early detection of diseases, personalized treatment plans, and efficient management of patient records. The finance sector benefits from AI algorithms that detect fraud, manage risks, and automate trading. Manufacturing processes are becoming more efficient with AI-driven predictive maintenance and quality control. Even agriculture is being transformed by AI, which optimizes crop yields and resource management.",
    "media": "video",
    "mediaPath": "/assets/images/video.mp4",
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["forYou"]
  },
  {
    "id": 3,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-2.png",
    "uploadedDate": "25/8/2024",
    "title": "Fit & Fabulous: Your Journey to a Healthier You",
    "description": "Welcome to \"Fit & Fabulous,\" your ultimate guide to achieving a healthier and more vibrant lifestyle! In this blog, we'll explore effective workout routines, balanced nutrition tips, motivational stories to inspire your fitness journey. Whether you're a beginner or a seasoned athlete, our goal is to provide you with practical advice and insights to help you reach your personal health goals. Discover how to stay consistent, overcome challenges, and celebrate your progress every step of the way. Join our community of fitness enthusiasts and let's embark on this transformative journey together. Get ready to become the best version of yourself—fit, fabulous, and unstoppable!",
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["forYou"]
  },
  {
    "id": 4,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-2.png",
    "uploadedDate": "25/8/2024",
    "title": "Home Horizons: Navigating the Real Estate Landscape",
    "description": "India celebrated a historic victory in the 2024 World Cup, triumphing with exceptional skill and resilience. Led by their captain's inspiring leadership, the team showcased dominance throughout the tournament, captivating fans worldwide.",
    "media": "carousal",
    "mediaPath": [
      "/assets/images/building-1.png",
      "/assets/images/building-2.png",
      "/assets/images/building-3.png"
    ],
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["forYou"]
  },
  {
    "id": 5,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-2.png",
    "uploadedDate": "25/8/2024",
    "title": "Acing Exams: Top Study Techniques That Really Work",
    "description": "Exams can be stressful, but with the right study techniques, you can ace them with confidence. In this post, we explore scientifically-backed methods like active recall, spaced repetition, and mind mapping that will help you retain more information in less time. Whether you're studying for finals or just trying to keep up with weekly quizzes, these strategies will transform the way you prepare for exams.",
    "media": "carousal",
    "mediaPath": [
      "/assets/images/exam-1.png",
      "/assets/images/exam-2.png",
      "/assets/images/exam-3.png"
    ],
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["following"]
  },
  {
    "id": 6,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-2.png",
    "uploadedDate": "25/8/2024",
    "title": "Movieverse Digest",
    "description": "Cinema Chronicles takes you on a journey through the world of films, from the latest blockbusters to timeless classics. Dive into reviews, behind-the-scenes stories, and thought-provoking analysis for every movie lover. ||| Screen Stories is a place where movies come alive beyond the screen. Discover in-depth reviews, movie breakdowns, and recommendations, whether you're into indie films or Hollywood hits.",
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["following"]
  },
  {
    "id": 7,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-20.png",
    "uploadedDate": "25/8/2024",
    "title": "The Football Frontier",
    "description": "The Football Frontier is where the beautiful game meets passionate analysis. Covering every inch of the pitch, from local matches to global tournaments, we bring you the latest news, match reports, player profiles, and in-depth tactical breakdowns. Whether you're a lifelong supporter or a new fan, this blog is your ultimate guide to everything football. Get ready to explore the strategies, rivalries, and unforgettable moments that make this sport the world's most beloved.",
    "media": "image",
    "mediaPath": "/assets/images/Football.png",
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["following"]
  },
  {
    "id": 8,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-22.png",
    "uploadedDate": "25/8/2024",
    "title": "Political Profiles: In-Depth Looks at Key Figures",
    "description": "Explores the lives and careers of influential leaders shaping our world. Each post offers a comprehensive analysis of their backgrounds, ideologies, and impacts on current affairs. Dive into the complexities of their political strategies and personal motivations. Stay informed with detailed profiles and gain a deeper understanding of the figures driving global change. Your go-to source for insightful political analysis.",
    "media": "image",
    "mediaPath": "/assets/images/politics-5.png",
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["following"]
  },
  {
    "id": 9,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-2.png",
    "uploadedDate": "1/9/2024",
    "title": "Savor the Flavor: A Culinary Journey Through Global Tastes",
    "description": "Welcome to a world where every dish tells a story, and every bite is an adventure. At Savor the Flavor, we explore global cuisines, bringing you recipes, tips, and the rich cultural history behind your favorite foods. From gourmet delights to comforting home-cooked meals, we're here to inspire your next culinary creation. Discover new ingredients, cooking techniques, and the secrets to crafting meals that leave a lasting impression. Whether you're a seasoned chef or a kitchen newbie, this blog is your guide to mastering the art of flavor.",
    "media": "carousal",
    "mediaPath": [
      "/assets/images/food-1.png",
      "/assets/images/food-2.png",
      "/assets/images/food-3.png"
    ],
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["recommended"]
  },
  {
    "id": 10,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-23.png",
    "uploadedDate": "25/8/2024",
    "title": "Political Landscape: Trends and Shifts in 2024",
    "description": "In 2024, the political landscape is witnessing significant shifts as global tensions and domestic issues reshape voter priorities. Climate change and economic inequality are increasingly driving policy debates, while populist and progressive movements gain traction in various regions. Technological advancements and social media continue to influence public opinion and campaign strategies. Additionally, international relations are evolving, with new alliances and rivalries emerging. The dynamic nature of these trends underscores the need for adaptable political strategies and informed citizen engagement.",
    "media": "carousal",
    "mediaPath": [
      "/assets/images/politics-1.png",
      "/assets/images/politics-2.png",
      "/assets/images/politics-3.png"
    ],
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["recommended"]
  },
  {
    "id": 11,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-2.png",
    "uploadedDate": "25/8/2024",
    "title": "The Backbone of Modern Applications: Exploring the Power of Databases",
    "description": "Databases are the unsung heroes of the digital age, powering everything from small apps to large-scale enterprise systems. They manage and store vast amounts of data, ensuring that information is accessible, secure, and organized. In this blog, we'll dive into the evolution of databases, from traditional relational models to cutting-edge NoSQL solutions, and discuss why they are critical to the success of modern applications. Whether you're a developer, a business owner, or just someone curious about technology, understanding databases will give you insights into how our digital world functions and how you can harness their power to drive innovation.",
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["recommended"]
  },
  {
    "id": 12,
    "uploadedBy": "Stefeno",
    "uploaderProfile": "/",
    "uploadedByImage": "/assets/images/user-21.png",
    "uploadedDate": "25/8/2024",
    "title": "Cricket's Greatest Rivalries: A Look at Iconic Matches",
    "description": "Cricket's greatest rivalries have produced some of the most thrilling matches in the sport's history. From the intense Ashes battles between England and Australia to the fierce India-Pakistan clashes, these encounters are defined by their high stakes and passionate fans. Iconic matches often feature dramatic turns, memorable performances, and historic moments that cement their place in cricket lore. The rivalries are not just about the teams but also the deep-seated national pride and fierce competition they represent. Each match adds a new chapter to the rich tapestry of cricket's storied rivalries.",
    "media": "image",
    "mediaPath": "/assets/images/sport-1.png",
    "noOfLikes": 2010,
    "noOfComments": 79,
    "noOfShares": 35,
    "categories": ["recommended"]
  }
]
